{"inkVersion":21,"root":[["^Even though you have to fend for yourself, there are other forces at work in this world besides the will of politics. You may choose a god to garner the favor of, if you’d like.","\n","^Crylus","\n","^The creator, the bringer of everything, if it exists it exists because Crylus wanted it to. Crylus does not touch or change anything that they’ve created, once it exists they simply observe with indifference.","\n","#","^+10% Morale throughout the game.","/#","^Nylann","\n","^Nylann is the only thing that Crylus has not created. Everything leaves the physical plane, no matter how powerful or weak something was when it existed, when it ceases to exist it follows the linear path to Nylann. In a plane of very little Nylann deals with everything, from soul to knowledge; everything that is no longer becomes Nylann’s.","\n","#","^Every time population is lost get +1 population","/#","^Olair","\n","^The god of the sun, gives warmth and light to the world. As the sister of Lannus, they hate each other and are constantly in a deadly battle to control the majority of the mortals 24 hours.","\n","#","^+3% percent fishery production","/#","^Lannus","\n","^The god of the Moon, gives darkness and cold. Left in darkness for ages Lannus is jealous of her sister as her beauty is only seen because of her sister's light, she hates her unfortunate circumstance and often abuses her power to feel like she matters. (playing with the tides, hiding her sister's warmth.)","\n","#","^+1 troop per 5 received","/#","^Maroe","\n","^The god of the ocean, gives water and controls the winds. Filled with pride Maroe loves all those who use his Oceans, though he very strictly abides by his principles of neutrality, he’s caused many disasters for the sake of an even playing field for all.","\n","#","^+3% food production","/#","^Tarrean","\n","^The god of the land gives the plentiful land that the kingdoms utilize. She does everything she possibly can for the mortals and all those in the physical plane. Despite her brother and sisters arguing and fighting against the humans, she tries to remain a constant for the humans.","\n","#","^+3% Material Production","/#","^Atheist","\n","^You don’t need the help of a government, and you certainly don’t need the help of some glorified spirit who doesn’t even know what it’s like to be human! You’ll fend for yourselves, and make it out even stronger because of it!","\n","#","^Any resources received get x1.5 for the first week, no bonus in the following week.","/#","ev","str","^Crylus","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Nylann","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^Olair","/str","/ev",{"*":"0.c-2","flg":20},"ev","str","^Lannus","/str","/ev",{"*":"0.c-3","flg":20},"ev","str","^Maroe","/str","/ev",{"*":"0.c-4","flg":20},"ev","str","^Tarrean","/str","/ev",{"*":"0.c-5","flg":20},"ev","str","^Atheis","/str","/ev",{"*":"0.c-6","flg":20},{"c-0":["\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"c-2":["\n",{"->":"0.g-0"},{"#f":5}],"c-3":["\n",{"->":"0.g-0"},{"#f":5}],"c-4":["\n",{"->":"0.g-0"},{"#f":5}],"c-5":["\n",{"->":"0.g-0"},{"#f":5}],"c-6":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}