{"inkVersion":21,"root":[[{"->":"START"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"START":["^Magic Disk Dealer","\n","^Lorraine:","\n","^“Kid, there’s a real interesting and weird vendor in town, even weirder than Roe. It’s called ‘Disk Stop’ and its selling  an experience where you pick a colored disk and then watch it through goggles. The owner claims that it lets you peer into another dimension but anyone who falls for that is just an idiot. But you should still try it out since you’re in charge.”","\n",{"->":"CHOICES"},{"#f":1}],"CHOICES":[["ev","str","^Red Disk.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^White Disk.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Gray Disk.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"RED_DISK"},"\n",{"#f":5}],"c-1":["^ ",{"->":"WHITE_DISK"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Gray_Disk"},"\n",{"#f":5}]}],{"#f":1}],"RED_DISK":["^In the red disk is a bloodied battlefield with numerous monstrous beasts roaming the ruins. You see 3 other people in the village try it after you and later you hear that they joined the guards. (Bloodborne 4)","\n","ev",3,{"x()":"Changetroops","exArgs":1},"pop","/ev","\n","#","^+3 Troops","/#","end",{"#f":1}],"WHITE_DISK":["^In the white disk is a restaurant with one angry chef and a lot of annoying customers, yet the chef never stops cooking. You recommend the disk to the Fisherman who gains some cooking knowledge making food taste a little better. (Chef Strikes Back)","\n","ev",1,"str","^Fishery","/str",{"x()":"ChangeBuildingProduction","exArgs":2},"pop","/ev","\n","#","^+1 Food production","/#","end",{"#f":1}],"Gray_Disk":["^In the gray disk is a gargantuan cave that endlessly sprawls out where everything seemed to be strangely square in shape but beautiful in design. You recommend the disk to the miner and he becomes even more enthused about his work. (Minecraft)","\n","ev",1,"str","^Mine","/str",{"x()":"ChangeBuildingProduction","exArgs":2},"pop","/ev","\n","#","^+1 Mining Production","/#","end",{"#f":1}],"#f":1}],"listDefs":{}}