{"inkVersion":21,"root":[[{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":["^Roe:","\n","^\"Hey boss! I was just digging ya know, as one does, and I heard the rumblings of the earth-mother awaking in ang- I mean I felt some tremors.\"","\n","^\"There might be a landslide incoming, big one. Would be fun, but not for the townsfolk I’d say. You could build a dam, but I’d love to fix that for you.\"","\n","^\"If you send me in I could probably make that whole thing go away for ya.\"","\n","^\"Probably.\"","\n","^What do you do?","\n",{"->":"Choices"},{"#f":1}],"Choices":[["ev","str","^Build a dam - Enough materials","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Send Roe in","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Run and hide","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"Dam"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Roe"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Run"},"\n",{"#f":5}]}],{"#f":1}],"Dam":["^With the help of most of the townsfolk, as well as Adelaine’s, you build a huge dam above the town.","\n","^When the landslide happens, most of the rocks crush against it, and the worst the town feels is a rain of pebbles.","\n","^The bond that unites the town is greater, now that they’ve worked together towards a common goal.","\n","#","^+10% Morale","/#","end",{"#f":1}],"Roe":[["ev","str","^Mine level 1-2","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Mine level 3-4","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Mine level 5","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"Mine12"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Mine34"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Mine5"},"\n","end",{"#f":5}]}],{"#f":1}],"Run":["^You don’t have the resources to build a dam, and you like Roe but trusting them with the safety of the whole town seems like a stretch.","\n","^You tell everyone to hide outside of town, and to take their belongings with them.","\n","^It is disheartening to see houses and a part of the town crushed under boulders, but at least the people are safe.","\n","#","^-25 Materials","/#","end",{"#f":1}],"Mine12":["^Roe goes in the mine, and reemerges a day later. For the first time in your life, it seems they are slightly panicked.","\n","^“Right boss, we may have a problem. Turns out she wasn’t too happy to see me. Who? Don’t you bother yourself about that. I think the main thing right now is to tell everyone to run and hide.”","\n","^A day later, the landslide comes, and the town isn’t ready. Houses are crushed and you lose a lot.","\n","#","^-25 Materials","/#","end",{"#f":1}],"Mine34":["^Roe goes in the mine, and reemerges a whole week later.","\n","^“Well wasn’t that intense! Wooh, I feel alive right now! The   l  landslide? Oh yeah that’s not happening, we’re tight now. Who with? Oh, don’t bother yourself about that. Right, well, back to business.”","\n","end",{"#f":1}],"Mine5":["^Roe goes in the mine, and is back a day later.","\n","^“Man do I love digging! What? Oh, the landslide! Yeah that’s not happening, we’re tight now. Who with? Oh, don’t bother yourself about that. Right, well, back to business.”","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}